/*******************************************************************************
* ファイル名 debugProc.h
* 作成者 AT-12C-245 秋間雄太
* 作成日 2015/11/26
*******************************************************************************/

/*** インクルードガード開始 ***/
#ifndef _DEBUGPROC_H_
#define _DEBUGPROC_H_


/*******************************************************************************
* マクロ定義
*******************************************************************************/

#define DEBUGPROC_MAX_CHAR_NUM (1024) // デバッグ文字列の最大数

/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/

HRESULT InitDebugProc(void);
void UninitDebugProc(void);
void UpdateDebugProc(void);
void DrawDebugProc(void);
void PrintDebugProc(char *fmt, ...);

#endif
/*** インクルードガード終了 ***/