//#ifndef _XFILE_H_
//#define _XFILE_H_
///******************************************************************************
//インクルードファイル
//*******************************************************************************/
//#include "sceneGL.h"
//
///******************************************************************************
//マクロ定義
//******************************************************************************/
///******************************************************************************
//構造体定義
//******************************************************************************/
//struct UV
//{
//	float u;//u値
//	float v;//v値
//};
//struct INDEX
//{
//	//位置インデックス
//	int indexPos;
//	//テクスチャインデックス
//	int indexTex;
//	//法線インデックス
//	int indexNor;
//};
//
///******************************************************************************
//クラス
//*******************************************************************************/
//class CXfile :public CSceneGL
//{
//	public://誰でも使える
//		CXfile(int priority = 1, OBJTYPE objType = OBJTYPE_NONE);
//		~CXfile( );
//		void Init(void);
//		void Uninit(void);
//		void Updete(void);
//		void Draw(void);
//		static CXfile *Create(const char *xFile, const char *tgaFile);
//		int Load(char *filename);
//	private://自分しか使えない
//		//頂点座標
//		VECTOR3 *m_VertexPos;
//		//UV情報
//		UV *m_uv2d;
//		//法線情報
//		VECTOR3 *m_nor;
//		//インデックス
//		INDEX *m_Index;
//		//頂点数
//		int m_VCnt;
//		//法線数
//		int m_NCnt;
//		//UV数
//		int m_UVCnt;
//		//頂点インデックス数
//		int m_ICnt;
//	protected://継承先クラスでは使える
//};
//#endif